Revit 2027 API
CableTray.IsValidCableTrayType Method
 Identifies if a cable tray type is valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidCableTrayType(
	Document document,
	ElementId cabletrayType
)
Public Shared Function IsValidCableTrayType (
	document As Document,
	cabletrayType As ElementId
) As Boolean
public:
static bool IsValidCableTrayType(
	Document^ document,
	ElementId^ cabletrayType
)
static member IsValidCableTrayType :
        document : Document *
        cabletrayType : ElementId -> bool
Parameters
document Document
 The document.
cabletrayType ElementId
 The cable tray type.
Return Value
Boolean
 True if the cable tray type is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CableTray Class
Autodesk.Revit.DB.Electrical Namespace